CSI API ETABS v1
cDesignCompositeColumn.SetTargetDispl Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetTargetDispl(
	int NumberItems,
	ref string[] LoadCase,
	ref string[] Point,
	ref double[] Displ,
	bool Active = true
)
Function SetTargetDispl (
	NumberItems As Integer,
	ByRef LoadCase As String(),
	ByRef Point As String(),
	ByRef Displ As Double(),
	Optional Active As Boolean = true
) As Integer
Dim instance As cDesignCompositeColumn
Dim NumberItems As Integer
Dim LoadCase As String()
Dim Point As String()
Dim Displ As Double()
Dim Active As Boolean
Dim returnValue As Integer
returnValue = instance.SetTargetDispl(NumberItems,
	LoadCase, Point, Displ, Active)
int SetTargetDispl(
	int NumberItems,
	array<String^>^% LoadCase,
	array<String^>^% Point,
	array<double>^% Displ,
	bool Active = true
)
abstract SetTargetDispl :
        NumberItems : int *
        LoadCase : string[] byref *
        Point : string[] byref *
        Displ : float[] byref *
        ?Active : bool
(* Defaults:
        let _Active = defaultArg Active true
*)
-> int
Parameters
NumberItems
Type: System.Int32
LoadCase
Type: System.String[]
Point
Type: System.String[]
Displ
Type: System.Double[]
Active (Optional)
Type: System.Boolean
Return Value
Type: Int32
See Also
Reference
cDesignCompositeColumn Interface
ETABSv1 Namespace